#include <stdio.h>
int main ()
{
    int x=10;  //ইন্টিজার ভেরিয়েবল নিলাম
    printf("%p \n", &x); /// x ভেরিয়েবলের এড্রেস প্রিন্ট করে দিলাম। এইখানে মনে রাখতে হবে যে %p হচ্ছে ফরম্যাট স্পেসিফায়ার, & এটা হচ্ছে মেমোরি এড্রেসেরর ঠিকানা।

    
    int* prt; // এইখানে * ব্যবহার করে পয়েন্টার ভেরিয়েবল ডিক্লিলিয়ার করা হলো। (ডাটা টাইপ * ভেরিয়েবল এর নাম) দিতে হয়
    prt=&x;  // x ইন্টিজার ভেঋয়েবল এর এড্রেস স্টোর করা হচ্ছে। 


    printf("%p \n",&prt);  // এইবার যেই নামে পয়েন্টার নিয়েছি সেই পয়েন্টারের এড্রেস প্রিন্ট করে দিলাম। 
    printf("%p\n", prt); //এইবার x এর এড্রেস প্রিন্তট করে দিলাম। কারন ptr পয়েন্টারে x এর এড্রেস স্টোর আছে।


    printf("%d\n", *prt);  // এইটা হচ্ছে পয়েন্টার ডিরেফারেন্সিং। মানে পয়েন্টারের এড্রেস একসেস করা হচ্ছে এবং প্রিন্ট করা হচ্ছে সেই মানটি। 
    *prt=233; // এইখানে সেই এড্রেস ডিফারেন্স করে সেই এড্রেসে গিয়ে 233 মানটি বসানো হচ্ছে। 
    printf("%d\n", x); //এখানে x  প্রিন্ট করলে 233 আউটপুট আসবে কারন আগের লাইনে আমরা ডিফারেন্সিং করে রেখেছি। 
    printf("%d", *prt); // আমরা মান চেইঞ্জ করার পর যদি আবার ডিফারন্স করি তাহলে আপডেটেট মানটিই আউটপুটে আসবে। 
    return 0;


    //  { পয়েন্টার জাস্ট মেমরি এড্রস নিয়ে কাজ করে। এটা দিয়ে স্ট্যাটিক মেমরি এবং ডায়নামিক মেমরিতে একসেস করা যায়। মেমরি এড্রেসগুলো হেক্সাডেসিমালে আসবে}
    // { * চিহ্ন দিয়ে পয়েন্টিং করা হয় এবং & চিহ্ন দ্বারা মেমরি এড্রেস খুজা হয়}
}